## Production
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/setup/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/fourkeys/fourkeys/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/fourkeys/fourkeys

To view this run in a browser, visit:
https://app.terraform.io/app/commoncode/fourkeys/runs/run-pR55tqE2VghpejyW

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.event_handler_random_value: Refreshing state... [id=4QpcGtjTCfhUB1Y0wQ23OtPGBCE]
google_service_account.fourkeys: Refreshing state... [id=projects/fourkeys-009742/serviceAccounts/fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_project_service.sm_api: Refreshing state... [id=fourkeys-009742/secretmanager.googleapis.com]
google_project_service.bq_api: Refreshing state... [id=fourkeys-009742/bigquery.googleapis.com]
google_project_service.run_api: Refreshing state... [id=fourkeys-009742/run.googleapis.com]
google_project_iam_member.parser_run_invoker: Refreshing state... [id=fourkeys-009742/roles/run.invoker/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_project_iam_member.parser_bq_project_access: Refreshing state... [id=fourkeys-009742/roles/bigquery.user/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.sentry_client: Refreshing state... [id=projects/fourkeys-009742/secrets/sentry-client/roles/secretmanager.secretAccessor/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_secret_manager_secret.event_handler: Refreshing state... [id=projects/fourkeys-009742/secrets/event-handler]
module.data_parser_service["github"].google_pubsub_topic.parser: Refreshing state... [id=projects/fourkeys-009742/topics/github]
google_cloud_run_service.event_handler: Refreshing state... [id=locations/australia-southeast1/namespaces/fourkeys-009742/services/event-handler]
google_bigquery_dataset.four_keys: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys]
module.dashboard_service.google_cloud_run_service.dashboard: Refreshing state... [id=locations/australia-southeast1/namespaces/fourkeys-009742/services/fourkeys-grafana-dashboard]
module.data_parser_service["github"].google_cloud_run_service.parser: Refreshing state... [id=locations/australia-southeast1/namespaces/fourkeys-009742/services/github-parser]
google_secret_manager_secret_iam_member.event_handler: Refreshing state... [id=projects/fourkeys-009742/secrets/event-handler/roles/secretmanager.secretAccessor/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_secret_manager_secret_version.event_handler: Refreshing state... [id=projects/810750187524/secrets/event-handler/versions/2]
module.data_parser_service["github"].google_pubsub_topic_iam_member.event_handler: Refreshing state... [id=projects/fourkeys-009742/topics/github/roles/editor/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_bigquery_routine.func_json2array: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/routines/json2array]
google_bigquery_routine.func_multiFormatParseTimestamp: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/routines/multiFormatParseTimestamp]
google_bigquery_dataset_iam_member.parser_bq: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/roles/bigquery.dataEditor/serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com]
google_bigquery_table.events_raw: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/events_raw]
google_cloud_run_service_iam_binding.noauth: Refreshing state... [id=v1/projects/fourkeys-009742/locations/australia-southeast1/services/event-handler/roles/run.invoker]
google_bigquery_table.view_changes: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/changes]
module.data_parser_service["github"].google_pubsub_subscription.parser: Refreshing state... [id=projects/fourkeys-009742/subscriptions/github-subscription]
google_bigquery_table.view_deployments: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/deployments]
google_bigquery_table.view_incidents: Refreshing state... [id=projects/fourkeys-009742/datasets/four_keys/tables/incidents]
module.dashboard_service.google_cloud_run_service_iam_binding.noauth: Refreshing state... [id=v1/projects/fourkeys-009742/locations/australia-southeast1/services/fourkeys-grafana-dashboard/roles/run.invoker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_cloud_run_service.event_handler has changed
  ~ resource "google_cloud_run_service" "event_handler" {
        id                         = "locations/australia-southeast1/namespaces/fourkeys-009742/services/event-handler"
        name                       = "event-handler"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "event-handler-n4rjx" -> "event-handler-00004-ceh"
              ~ latest_ready_revision_name   = "event-handler-n4rjx" -> "event-handler-00004-ceh"
              ~ observed_generation          = 1 -> 4
                # (2 unchanged elements hidden)
            },
        ]
        # (3 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "\"client.knative.dev/user-image\""     = "gcr.io/fourkeys-009742/event-handler@sha256:ba994af8b1cf0eb91ab77353a353e6f7f8f949accd78a3c60f542e3d0f016c59"
              + "\"run.googleapis.com/client-name\""    = "cloud-console"
              ~ "\"serving.knative.dev/lastModifier\""  = "terraform@fourkeys-009742.iam.gserviceaccount.com" -> "justin.arulnathan@commoncode.io"
                # (3 unchanged elements hidden)
            }
          ~ generation       = 1 -> 4
          ~ resource_version = "AAXcVq0gjqk" -> "AAXdDTFZQ6U"
            # (4 unchanged attributes hidden)
        }

      ~ template {
          ~ metadata {
              ~ annotations = {
                  + "\"client.knative.dev/user-image\""    = "gcr.io/fourkeys-009742/event-handler@sha256:d96fbe7d10b40d632d73f0ca7d956b537b8d63af05b23b2714557bedd57df51a"
                  + "\"run.googleapis.com/client-name\""   = "cloud-console"
                    # (1 unchanged element hidden)
                }
              + name        = "event-handler-00004-ceh"
                # (2 unchanged attributes hidden)
            }

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "gcr.io/fourkeys-009742/event-handler" -> "gcr.io/fourkeys-009742/event-handler@sha256:ba994af8b1cf0eb91ab77353a353e6f7f8f949accd78a3c60f542e3d0f016c59"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.event_handler will be updated in-place
  ~ resource "google_cloud_run_service" "event_handler" {
        id                         = "locations/australia-southeast1/namespaces/fourkeys-009742/services/event-handler"
        name                       = "event-handler"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "gcr.io/fourkeys-009742/event-handler@sha256:ba994af8b1cf0eb91ab77353a353e6f7f8f949accd78a3c60f542e3d0f016c59" -> "gcr.io/fourkeys-009742/event-handler"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.dashboard_service.google_cloud_run_service.dashboard will be updated in-place
  ~ resource "google_cloud_run_service" "dashboard" {
        id                         = "locations/australia-southeast1/namespaces/fourkeys-009742/services/fourkeys-grafana-dashboard"
        name                       = "fourkeys-grafana-dashboard"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)


                  ~ ports {
                      - name           = "http1" -> null
                        # (1 unchanged attribute hidden)
                    }

                    # (2 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.data_parser_service["sentry"].google_cloud_run_service.parser will be created
  + resource "google_cloud_run_service" "parser" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "australia-southeast1"
      + name                       = "sentry-parser"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "created_by" = "fourkeys"
            }
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "fourkeys@fourkeys-009742.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "gcr.io/fourkeys-009742/sentry-parser"

                  + env {
                      + name  = "PROJECT_NAME"
                      + value = "fourkeys-009742"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # module.data_parser_service["sentry"].google_pubsub_subscription.parser will be created
  + resource "google_pubsub_subscription" "parser" {
      + ack_deadline_seconds       = (known after apply)
      + id                         = (known after apply)
      + labels                     = {
          + "created_by" = "fourkeys"
        }
      + message_retention_duration = "604800s"
      + name                       = "sentry-subscription"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + topic                      = (known after apply)

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = (known after apply)

          + oidc_token {
              + service_account_email = "fourkeys@fourkeys-009742.iam.gserviceaccount.com"
            }
        }
    }

  # module.data_parser_service["sentry"].google_pubsub_topic.parser will be created
  + resource "google_pubsub_topic" "parser" {
      + id      = (known after apply)
      + labels  = {
          + "created_by" = "fourkeys"
        }
      + name    = "sentry"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.data_parser_service["sentry"].google_pubsub_topic_iam_member.event_handler will be created
  + resource "google_pubsub_topic_iam_member" "event_handler" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fourkeys@fourkeys-009742.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/editor"
      + topic   = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

```
</details>
*Pusher: @dinie, Action: `pull_request`*